#+title: Not All Compilers Are Created Equally

Here are some snippets to test to show common differences and issues with programming in C++.

* Section 1

Sometimes integer and long are defined as varying sizes.

#+begin_src C++
#include <iostream>

int main() {
    std::cout << "Integer is " << sizeof(int) << " bytes." << '\n';
    std::cout << "Long is " << sizeof(long) << " bytes." << '\n';

    return 0;
}
#+end_src

#+RESULTS:
| Integer | is | 4 | bytes. |
| Long    | is | 8 | bytes. |
